#include<stdio.h>
int main()
{
	int x[5][5] = { {0,1,2,3,4},{5,6,7,8,9},{10,11,12,13,14},{15,16,17,18,19},{20,21,22,23,24} }; //첫번째 [5x5] 행렬
	int y[5][5] = { {4,3,2,1,0},{9,8,7,6,5},{14,13,12,11,10},{19,18,17,16,15},{24,23,22,21,20} }; //두번째 [5x5] 행렬
	int result[5][5]; //결과값 [5x5]행렬
	int p, q, r;

	for (p = 0; p < 5; p++)
	{
		for (r = 0; r < 5; r++)
		{
			result[p][r] = 0;  //결과값 [5x5]행렬 0으로 초기화
		}
	}

	for (p = 0; p < 5; p++)
	{
		for (r = 0; r < 5; r++)
		{
			for (q = 0; q < 5; q++)
			{
				result[p][r] += x[p][q] * y[q][r]; //for문을 통해서 q=0,1,2,3,4까지 반복하면서 result[p][r]에 더한다.
			}

		}
	}

	for (int k = 0; k < 5; k++)
	{
		for (int o = 0; o < 5; o++)
		{
			printf("%6d", result[k][o]); //for문으로 반복하면서 결과값 [5x5]행렬을 출력한다.
		}
		printf("\n");
	}
}